performance.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
scenarios:
  - name: 'Get Todos'
    flow:
      - get:
          url: '/'
  - name: 'Create Todo'
    flow:
      - post:
          url: '/create'
          body:
            todo: 'Buy groceries'

  - name: 'Update Todo'
    flow:
      - post:
          url: '/update/1'
          body:
            completed: true

  - name: 'Delete Todo'
    flow:
      - post:
          url: '/delete/1'